# SetIgnoredCategoryIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..SetIgnoredCategoryIds Method
RouteAnalysisSettings Class See Also
---
Sets the ElementIds for Category elements which are ignored by route calculation.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public void SetIgnoredCategoryIds(
	ICollection<ElementId> categoryIds
)
```

Visual Basic
---
```text
Public Sub SetIgnoredCategoryIds ( _
	categoryIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetIgnoredCategoryIds(
	ICollection<ElementId^>^ categoryIds
)
```

# ### Parameters
categoryIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The ids of Categories to be ignored by route calculation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more ElementIds in categoryIds are not valid Category element ids. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace